ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157cxx_cm4.h
/*****************  Bit definition for DDRPHYC_DCR register  ******************/
#define DDRPHYC_DCR_DDRMD_Pos   (0U)
#define DDRPHYC_DCR_DDRMD_Msk   (0x7U << DDRPHYC_DCR_DDRMD_Pos)   /*!< 0x00000007 */
#define DDRPHYC_DCR_DDRMD       DDRPHYC_DCR_DDRMD_Msk             /*!< SDRAM DDR mode */
#define DDRPHYC_DCR_DDRMD_0     (0x1U << DDRPHYC_DCR_DDRMD_Pos)   /*!< 0x00000001 */
#define DDRPHYC_DCR_DDRMD_1     (0x2U << DDRPHYC_DCR_DDRMD_Pos)   /*!< 0x00000002 */
#define DDRPHYC_DCR_DDRMD_2     (0x4U << DDRPHYC_DCR_DDRMD_Pos)   /*!< 0x00000004 */
#define DDRPHYC_DCR_DDR8BNK_Pos (3U)
#define DDRPHYC_DCR_DDR8BNK_Msk (0x1U << DDRPHYC_DCR_DDR8BNK_Pos) /*!< 0x00000008 */
#define DDRPHYC_DCR_DDR8BNK     DDRPHYC_DCR_DDR8BNK_Msk           /*!< DDR 8 banks */
#define DDRPHYC_DCR_PDQ_Pos     (4U)
#define DDRPHYC_DCR_PDQ_Msk     (0x7U << DDRPHYC_DCR_PDQ_Pos)     /*!< 0x00000070 */
#define DDRPHYC_DCR_PDQ         DDRPHYC_DCR_PDQ_Msk               /*!< Primary DQ(DDR3 Only) */
#define DDRPHYC_DCR_PDQ_0       (0x1U << DDRPHYC_DCR_PDQ_Pos)     /*!< 0x00000010 */
#define DDRPHYC_DCR_PDQ_1       (0x2U << DDRPHYC_DCR_PDQ_Pos)     /*!< 0x00000020 */
#define DDRPHYC_DCR_PDQ_2       (0x4U << DDRPHYC_DCR_PDQ_Pos)     /*!< 0x00000040 */
#define DDRPHYC_DCR_MPRDQ_Pos   (7U)
#define DDRPHYC_DCR_MPRDQ_Msk   (0x1U << DDRPHYC_DCR_MPRDQ_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DCR_MPRDQ       DDRPHYC_DCR_MPRDQ_Msk             /*!< MPR DQ */
#define DDRPHYC_DCR_DDRTYPE_Pos (8U)
#define DDRPHYC_DCR_DDRTYPE_Msk (0x3U << DDRPHYC_DCR_DDRTYPE_Pos) /*!< 0x00000300 */
#define DDRPHYC_DCR_DDRTYPE     DDRPHYC_DCR_DDRTYPE_Msk           /*!< DDR type (LPDDR2 S4) */
#define DDRPHYC_DCR_DDRTYPE_0   (0x1U << DDRPHYC_DCR_DDRTYPE_Pos) /*!< 0x00000100 */
#define DDRPHYC_DCR_DDRTYPE_1   (0x2U << DDRPHYC_DCR_DDRTYPE_Pos) /*!< 0x00000200 */
#define DDRPHYC_DCR_NOSRA_Pos   (27U)
#define DDRPHYC_DCR_NOSRA_Msk   (0x1U << DDRPHYC_DCR_NOSRA_Pos)   /*!< 0x08000000 */
#define DDRPHYC_DCR_NOSRA       DDRPHYC_DCR_NOSRA_Msk             /*!< No simultaneous rank access */
#define DDRPHYC_DCR_DDR2T_Pos   (28U)
#define DDRPHYC_DCR_DDR2T_Msk   (0x1U << DDRPHYC_DCR_DDR2T_Pos)   /*!< 0x10000000 */
#define DDRPHYC_DCR_DDR2T       DDRPHYC_DCR_DDR2T_Msk             /*!< 2T timing */
#define DDRPHYC_DCR_UDIMM_Pos   (29U)
#define DDRPHYC_DCR_UDIMM_Msk   (0x1U << DDRPHYC_DCR_UDIMM_Pos)   /*!< 0x20000000 */
#define DDRPHYC_DCR_UDIMM       DDRPHYC_DCR_UDIMM_Msk             /*!< Unbuffered DIMM */
#define DDRPHYC_DCR_RDIMM_Pos   (30U)
#define DDRPHYC_DCR_RDIMM_Msk   (0x1U << DDRPHYC_DCR_RDIMM_Pos)   /*!< 0x40000000 */
#define DDRPHYC_DCR_RDIMM       DDRPHYC_DCR_RDIMM_Msk             /*!< Registered DIMM */
#define DDRPHYC_DCR_TPD_Pos     (31U)
#define DDRPHYC_DCR_TPD_Msk     (0x1U << DDRPHYC_DCR_TPD_Pos)     /*!< 0x80000000 */
#define DDRPHYC_DCR_TPD         DDRPHYC_DCR_TPD_Msk               /*!< Test power down (N/A LPDDR only) */

/****************  Bit definition for DDRPHYC_DTPR0 register  *****************/
#define DDRPHYC_DTPR0_TMRD_Pos (0U)
#define DDRPHYC_DTPR0_TMRD_Msk (0x3U << DDRPHYC_DTPR0_TMRD_Pos)  /*!< 0x00000003 */
#define DDRPHYC_DTPR0_TMRD     DDRPHYC_DTPR0_TMRD_Msk            /*!< tMRD */
#define DDRPHYC_DTPR0_TMRD_0   (0x1U << DDRPHYC_DTPR0_TMRD_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DTPR0_TMRD_1   (0x2U << DDRPHYC_DTPR0_TMRD_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DTPR0_TRTP_Pos (2U)
#define DDRPHYC_DTPR0_TRTP_Msk (0x7U << DDRPHYC_DTPR0_TRTP_Pos)  /*!< 0x0000001C */
#define DDRPHYC_DTPR0_TRTP     DDRPHYC_DTPR0_TRTP_Msk            /*!< tRTP */
#define DDRPHYC_DTPR0_TRTP_0   (0x1U << DDRPHYC_DTPR0_TRTP_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DTPR0_TRTP_1   (0x2U << DDRPHYC_DTPR0_TRTP_Pos)  /*!< 0x00000008 */
#define DDRPHYC_DTPR0_TRTP_2   (0x4U << DDRPHYC_DTPR0_TRTP_Pos)  /*!< 0x00000010 */
#define DDRPHYC_DTPR0_TWTR_Pos (5U)
#define DDRPHYC_DTPR0_TWTR_Msk (0x7U << DDRPHYC_DTPR0_TWTR_Pos)  /*!< 0x000000E0 */
#define DDRPHYC_DTPR0_TWTR     DDRPHYC_DTPR0_TWTR_Msk            /*!< tWTR */
#define DDRPHYC_DTPR0_TWTR_0   (0x1U << DDRPHYC_DTPR0_TWTR_Pos)  /*!< 0x00000020 */
#define DDRPHYC_DTPR0_TWTR_1   (0x2U << DDRPHYC_DTPR0_TWTR_Pos)  /*!< 0x00000040 */
#define DDRPHYC_DTPR0_TWTR_2   (0x4U << DDRPHYC_DTPR0_TWTR_Pos)  /*!< 0x00000080 */
#define DDRPHYC_DTPR0_TRP_Pos  (8U)
#define DDRPHYC_DTPR0_TRP_Msk  (0xFU << DDRPHYC_DTPR0_TRP_Pos)   /*!< 0x00000F00 */
#define DDRPHYC_DTPR0_TRP      DDRPHYC_DTPR0_TRP_Msk             /*!< tRP */
#define DDRPHYC_DTPR0_TRP_0    (0x1U << DDRPHYC_DTPR0_TRP_Pos)   /*!< 0x00000100 */
#define DDRPHYC_DTPR0_TRP_1    (0x2U << DDRPHYC_DTPR0_TRP_Pos)   /*!< 0x00000200 */
#define DDRPHYC_DTPR0_TRP_2    (0x4U << DDRPHYC_DTPR0_TRP_Pos)   /*!< 0x00000400 */
#define DDRPHYC_DTPR0_TRP_3    (0x8U << DDRPHYC_DTPR0_TRP_Pos)   /*!< 0x00000800 */
#define DDRPHYC_DTPR0_TRCD_Pos (12U)
#define DDRPHYC_DTPR0_TRCD_Msk (0xFU << DDRPHYC_DTPR0_TRCD_Pos)  /*!< 0x0000F000 */
#define DDRPHYC_DTPR0_TRCD     DDRPHYC_DTPR0_TRCD_Msk            /*!< tRCD */
#define DDRPHYC_DTPR0_TRCD_0   (0x1U << DDRPHYC_DTPR0_TRCD_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DTPR0_TRCD_1   (0x2U << DDRPHYC_DTPR0_TRCD_Pos)  /*!< 0x00002000 */
#define DDRPHYC_DTPR0_TRCD_2   (0x4U << DDRPHYC_DTPR0_TRCD_Pos)  /*!< 0x00004000 */
#define DDRPHYC_DTPR0_TRCD_3   (0x8U << DDRPHYC_DTPR0_TRCD_Pos)  /*!< 0x00008000 */
#define DDRPHYC_DTPR0_TRAS_Pos (16U)
#define DDRPHYC_DTPR0_TRAS_Msk (0x1FU << DDRPHYC_DTPR0_TRAS_Pos) /*!< 0x001F0000 */
#define DDRPHYC_DTPR0_TRAS     DDRPHYC_DTPR0_TRAS_Msk            /*!< tRAS */
#define DDRPHYC_DTPR0_TRAS_0   (0x1U << DDRPHYC_DTPR0_TRAS_Pos)  /*!< 0x00010000 */
#define DDRPHYC_DTPR0_TRAS_1   (0x2U << DDRPHYC_DTPR0_TRAS_Pos)  /*!< 0x00020000 */
#define DDRPHYC_DTPR0_TRAS_2   (0x4U << DDRPHYC_DTPR0_TRAS_Pos)  /*!< 0x00040000 */
#define DDRPHYC_DTPR0_TRAS_3   (0x8U << DDRPHYC_DTPR0_TRAS_Pos)  /*!< 0x00080000 */
#define DDRPHYC_DTPR0_TRAS_4   (0x10U << DDRPHYC_DTPR0_TRAS_Pos) /*!< 0x00100000 */
#define DDRPHYC_DTPR0_TRRD_Pos (21U)
#define DDRPHYC_DTPR0_TRRD_Msk (0xFU << DDRPHYC_DTPR0_TRRD_Pos)  /*!< 0x01E00000 */
#define DDRPHYC_DTPR0_TRRD     DDRPHYC_DTPR0_TRRD_Msk            /*!< tRRD */
#define DDRPHYC_DTPR0_TRRD_0   (0x1U << DDRPHYC_DTPR0_TRRD_Pos)  /*!< 0x00200000 */
#define DDRPHYC_DTPR0_TRRD_1   (0x2U << DDRPHYC_DTPR0_TRRD_Pos)  /*!< 0x00400000 */
#define DDRPHYC_DTPR0_TRRD_2   (0x4U << DDRPHYC_DTPR0_TRRD_Pos)  /*!< 0x00800000 */
#define DDRPHYC_DTPR0_TRRD_3   (0x8U << DDRPHYC_DTPR0_TRRD_Pos)  /*!< 0x01000000 */
#define DDRPHYC_DTPR0_TRC_Pos  (25U)
#define DDRPHYC_DTPR0_TRC_Msk  (0x3FU << DDRPHYC_DTPR0_TRC_Pos)  /*!< 0x7E000000 */
#define DDRPHYC_DTPR0_TRC      DDRPHYC_DTPR0_TRC_Msk             /*!< tRC */
#define DDRPHYC_DTPR0_TRC_0    (0x1U << DDRPHYC_DTPR0_TRC_Pos)   /*!< 0x02000000 */
#define DDRPHYC_DTPR0_TRC_1    (0x2U << DDRPHYC_DTPR0_TRC_Pos)   /*!< 0x04000000 */
#define DDRPHYC_DTPR0_TRC_2    (0x4U << DDRPHYC_DTPR0_TRC_Pos)   /*!< 0x08000000 */
#define DDRPHYC_DTPR0_TRC_3    (0x8U << DDRPHYC_DTPR0_TRC_Pos)   /*!< 0x10000000 */
#define DDRPHYC_DTPR0_TRC_4    (0x10U << DDRPHYC_DTPR0_TRC_Pos)  /*!< 0x20000000 */
#define DDRPHYC_DTPR0_TRC_5    (0x20U << DDRPHYC_DTPR0_TRC_Pos)  /*!< 0x40000000 */
#define DDRPHYC_DTPR0_TCCD_Pos (31U)
#define DDRPHYC_DTPR0_TCCD_Msk (0x1U << DDRPHYC_DTPR0_TCCD_Pos)  /*!< 0x80000000 */
#define DDRPHYC_DTPR0_TCCD     DDRPHYC_DTPR0_TCCD_Msk            /*!< tCCDRead to read and write to write command delay */

/****************  Bit definition for DDRPHYC_DTPR1 register  *****************/
#define DDRPHYC_DTPR1_TAOND_Pos     (0U)
#define DDRPHYC_DTPR1_TAOND_Msk     (0x3U << DDRPHYC_DTPR1_TAOND_Pos)     /*!< 0x00000003 */
#define DDRPHYC_DTPR1_TAOND         DDRPHYC_DTPR1_TAOND_Msk               /*!< tAOND/tAOFD */
#define DDRPHYC_DTPR1_TAOND_0       (0x1U << DDRPHYC_DTPR1_TAOND_Pos)     /*!< 0x00000001 */
#define DDRPHYC_DTPR1_TAOND_1       (0x2U << DDRPHYC_DTPR1_TAOND_Pos)     /*!< 0x00000002 */
#define DDRPHYC_DTPR1_TRTW_Pos      (2U)
#define DDRPHYC_DTPR1_TRTW_Msk      (0x1U << DDRPHYC_DTPR1_TRTW_Pos)      /*!< 0x00000004 */
#define DDRPHYC_DTPR1_TRTW          DDRPHYC_DTPR1_TRTW_Msk                /*!< tRTW */
#define DDRPHYC_DTPR1_TFAW_Pos      (3U)
#define DDRPHYC_DTPR1_TFAW_Msk      (0x3FU << DDRPHYC_DTPR1_TFAW_Pos)     /*!< 0x000001F8 */
#define DDRPHYC_DTPR1_TFAW          DDRPHYC_DTPR1_TFAW_Msk                /*!< tFAW */
#define DDRPHYC_DTPR1_TFAW_0        (0x1U << DDRPHYC_DTPR1_TFAW_Pos)      /*!< 0x00000008 */
#define DDRPHYC_DTPR1_TFAW_1        (0x2U << DDRPHYC_DTPR1_TFAW_Pos)      /*!< 0x00000010 */
#define DDRPHYC_DTPR1_TFAW_2        (0x4U << DDRPHYC_DTPR1_TFAW_Pos)      /*!< 0x00000020 */
#define DDRPHYC_DTPR1_TFAW_3        (0x8U << DDRPHYC_DTPR1_TFAW_Pos)      /*!< 0x00000040 */
#define DDRPHYC_DTPR1_TFAW_4        (0x10U << DDRPHYC_DTPR1_TFAW_Pos)     /*!< 0x00000080 */
#define DDRPHYC_DTPR1_TFAW_5        (0x20U << DDRPHYC_DTPR1_TFAW_Pos)     /*!< 0x00000100 */
#define DDRPHYC_DTPR1_TMOD_Pos      (9U)
#define DDRPHYC_DTPR1_TMOD_Msk      (0x3U << DDRPHYC_DTPR1_TMOD_Pos)      /*!< 0x00000600 */
#define DDRPHYC_DTPR1_TMOD          DDRPHYC_DTPR1_TMOD_Msk                /*!< tMOD */
#define DDRPHYC_DTPR1_TMOD_0        (0x1U << DDRPHYC_DTPR1_TMOD_Pos)      /*!< 0x00000200 */
#define DDRPHYC_DTPR1_TMOD_1        (0x2U << DDRPHYC_DTPR1_TMOD_Pos)      /*!< 0x00000400 */
#define DDRPHYC_DTPR1_TRTODT_Pos    (11U)
#define DDRPHYC_DTPR1_TRTODT_Msk    (0x1U << DDRPHYC_DTPR1_TRTODT_Pos)    /*!< 0x00000800 */
#define DDRPHYC_DTPR1_TRTODT        DDRPHYC_DTPR1_TRTODT_Msk              /*!< tRTODT */
#define DDRPHYC_DTPR1_TRFC_Pos      (16U)
#define DDRPHYC_DTPR1_TRFC_Msk      (0xFFU << DDRPHYC_DTPR1_TRFC_Pos)     /*!< 0x00FF0000 */
#define DDRPHYC_DTPR1_TRFC          DDRPHYC_DTPR1_TRFC_Msk                /*!< tRFC */
#define DDRPHYC_DTPR1_TRFC_0        (0x1U << DDRPHYC_DTPR1_TRFC_Pos)      /*!< 0x00010000 */
#define DDRPHYC_DTPR1_TRFC_1        (0x2U << DDRPHYC_DTPR1_TRFC_Pos)      /*!< 0x00020000 */
#define DDRPHYC_DTPR1_TRFC_2        (0x4U << DDRPHYC_DTPR1_TRFC_Pos)      /*!< 0x00040000 */
#define DDRPHYC_DTPR1_TRFC_3        (0x8U << DDRPHYC_DTPR1_TRFC_Pos)      /*!< 0x00080000 */
#define DDRPHYC_DTPR1_TRFC_4        (0x10U << DDRPHYC_DTPR1_TRFC_Pos)     /*!< 0x00100000 */
#define DDRPHYC_DTPR1_TRFC_5        (0x20U << DDRPHYC_DTPR1_TRFC_Pos)     /*!< 0x00200000 */
#define DDRPHYC_DTPR1_TRFC_6        (0x40U << DDRPHYC_DTPR1_TRFC_Pos)     /*!< 0x00400000 */
#define DDRPHYC_DTPR1_TRFC_7        (0x80U << DDRPHYC_DTPR1_TRFC_Pos)     /*!< 0x00800000 */
#define DDRPHYC_DTPR1_TDQSCKMIN_Pos (24U)
#define DDRPHYC_DTPR1_TDQSCKMIN_Msk (0x7U << DDRPHYC_DTPR1_TDQSCKMIN_Pos) /*!< 0x07000000 */
#define DDRPHYC_DTPR1_TDQSCKMIN     DDRPHYC_DTPR1_TDQSCKMIN_Msk           /*!< tDQSCKmin */
#define DDRPHYC_DTPR1_TDQSCKMIN_0   (0x1U << DDRPHYC_DTPR1_TDQSCKMIN_Pos) /*!< 0x01000000 */
#define DDRPHYC_DTPR1_TDQSCKMIN_1   (0x2U << DDRPHYC_DTPR1_TDQSCKMIN_Pos) /*!< 0x02000000 */
#define DDRPHYC_DTPR1_TDQSCKMIN_2   (0x4U << DDRPHYC_DTPR1_TDQSCKMIN_Pos) /*!< 0x04000000 */
#define DDRPHYC_DTPR1_TDQSCKMAX_Pos (27U)
#define DDRPHYC_DTPR1_TDQSCKMAX_Msk (0x7U << DDRPHYC_DTPR1_TDQSCKMAX_Pos) /*!< 0x38000000 */
#define DDRPHYC_DTPR1_TDQSCKMAX     DDRPHYC_DTPR1_TDQSCKMAX_Msk           /*!< tDQSCKmax */
#define DDRPHYC_DTPR1_TDQSCKMAX_0   (0x1U << DDRPHYC_DTPR1_TDQSCKMAX_Pos) /*!< 0x08000000 */
#define DDRPHYC_DTPR1_TDQSCKMAX_1   (0x2U << DDRPHYC_DTPR1_TDQSCKMAX_Pos) /*!< 0x10000000 */
#define DDRPHYC_DTPR1_TDQSCKMAX_2   (0x4U << DDRPHYC_DTPR1_TDQSCKMAX_Pos) /*!< 0x20000000 */

/****************  Bit definition for DDRPHYC_DTPR2 register  *****************/
#define DDRPHYC_DTPR2_TXS_Pos   (0U)
#define DDRPHYC_DTPR2_TXS_Msk   (0x3FFU << DDRPHYC_DTPR2_TXS_Pos)   /*!< 0x000003FF */
#define DDRPHYC_DTPR2_TXS       DDRPHYC_DTPR2_TXS_Msk               /*!< tXS */
#define DDRPHYC_DTPR2_TXS_0     (0x1U << DDRPHYC_DTPR2_TXS_Pos)     /*!< 0x00000001 */
#define DDRPHYC_DTPR2_TXS_1     (0x2U << DDRPHYC_DTPR2_TXS_Pos)     /*!< 0x00000002 */
#define DDRPHYC_DTPR2_TXS_2     (0x4U << DDRPHYC_DTPR2_TXS_Pos)     /*!< 0x00000004 */
#define DDRPHYC_DTPR2_TXS_3     (0x8U << DDRPHYC_DTPR2_TXS_Pos)     /*!< 0x00000008 */
#define DDRPHYC_DTPR2_TXS_4     (0x10U << DDRPHYC_DTPR2_TXS_Pos)    /*!< 0x00000010 */
#define DDRPHYC_DTPR2_TXS_5     (0x20U << DDRPHYC_DTPR2_TXS_Pos)    /*!< 0x00000020 */
#define DDRPHYC_DTPR2_TXS_6     (0x40U << DDRPHYC_DTPR2_TXS_Pos)    /*!< 0x00000040 */
#define DDRPHYC_DTPR2_TXS_7     (0x80U << DDRPHYC_DTPR2_TXS_Pos)    /*!< 0x00000080 */
#define DDRPHYC_DTPR2_TXS_8     (0x100U << DDRPHYC_DTPR2_TXS_Pos)   /*!< 0x00000100 */
#define DDRPHYC_DTPR2_TXS_9     (0x200U << DDRPHYC_DTPR2_TXS_Pos)   /*!< 0x00000200 */
#define DDRPHYC_DTPR2_TXP_Pos   (10U)                             
#define DDRPHYC_DTPR2_TXP_Msk   (0x1FU << DDRPHYC_DTPR2_TXP_Pos)    /*!< 0x00007C00 */
#define DDRPHYC_DTPR2_TXP       DDRPHYC_DTPR2_TXP_Msk               /*!< tXP */
#define DDRPHYC_DTPR2_TXP_0     (0x1U << DDRPHYC_DTPR2_TXP_Pos)     /*!< 0x00000400 */
#define DDRPHYC_DTPR2_TXP_1     (0x2U << DDRPHYC_DTPR2_TXP_Pos)     /*!< 0x00000800 */
#define DDRPHYC_DTPR2_TXP_2     (0x4U << DDRPHYC_DTPR2_TXP_Pos)     /*!< 0x00001000 */
#define DDRPHYC_DTPR2_TXP_3     (0x8U << DDRPHYC_DTPR2_TXP_Pos)     /*!< 0x00002000 */
#define DDRPHYC_DTPR2_TXP_4     (0x10U << DDRPHYC_DTPR2_TXP_Pos)    /*!< 0x00004000 */
#define DDRPHYC_DTPR2_TCKE_Pos  (15U)                             
#define DDRPHYC_DTPR2_TCKE_Msk  (0xFU << DDRPHYC_DTPR2_TCKE_Pos)    /*!< 0x00078000 */
#define DDRPHYC_DTPR2_TCKE      DDRPHYC_DTPR2_TCKE_Msk              /*!< tCKE */
#define DDRPHYC_DTPR2_TCKE_0    (0x1U << DDRPHYC_DTPR2_TCKE_Pos)    /*!< 0x00008000 */
#define DDRPHYC_DTPR2_TCKE_1    (0x2U << DDRPHYC_DTPR2_TCKE_Pos)    /*!< 0x00010000 */
#define DDRPHYC_DTPR2_TCKE_2    (0x4U << DDRPHYC_DTPR2_TCKE_Pos)    /*!< 0x00020000 */
#define DDRPHYC_DTPR2_TCKE_3    (0x8U << DDRPHYC_DTPR2_TCKE_Pos)    /*!< 0x00040000 */
#define DDRPHYC_DTPR2_TDLLK_Pos (19U)
#define DDRPHYC_DTPR2_TDLLK_Msk (0x3FFU << DDRPHYC_DTPR2_TDLLK_Pos) /*!< 0x1FF80000 */
#define DDRPHYC_DTPR2_TDLLK     DDRPHYC_DTPR2_TDLLK_Msk             /*!< tDLLK */
#define DDRPHYC_DTPR2_TDLLK_0   (0x1U << DDRPHYC_DTPR2_TDLLK_Pos)   /*!< 0x00080000 */
#define DDRPHYC_DTPR2_TDLLK_1   (0x2U << DDRPHYC_DTPR2_TDLLK_Pos)   /*!< 0x00100000 */
#define DDRPHYC_DTPR2_TDLLK_2   (0x4U << DDRPHYC_DTPR2_TDLLK_Pos)   /*!< 0x00200000 */
#define DDRPHYC_DTPR2_TDLLK_3   (0x8U << DDRPHYC_DTPR2_TDLLK_Pos)   /*!< 0x00400000 */
#define DDRPHYC_DTPR2_TDLLK_4   (0x10U << DDRPHYC_DTPR2_TDLLK_Pos)  /*!< 0x00800000 */
#define DDRPHYC_DTPR2_TDLLK_5   (0x20U << DDRPHYC_DTPR2_TDLLK_Pos)  /*!< 0x01000000 */
#define DDRPHYC_DTPR2_TDLLK_6   (0x40U << DDRPHYC_DTPR2_TDLLK_Pos)  /*!< 0x02000000 */
#define DDRPHYC_DTPR2_TDLLK_7   (0x80U << DDRPHYC_DTPR2_TDLLK_Pos)  /*!< 0x04000000 */
#define DDRPHYC_DTPR2_TDLLK_8   (0x100U << DDRPHYC_DTPR2_TDLLK_Pos) /*!< 0x08000000 */
#define DDRPHYC_DTPR2_TDLLK_9   (0x200U << DDRPHYC_DTPR2_TDLLK_Pos) /*!< 0x10000000 */

/***************  Bit definition for DDRPHYC_DDR3_MR0 register  ***************/
#define DDRPHYC_DDR3_MR0_BL_Pos   (0U)
#define DDRPHYC_DDR3_MR0_BL_Msk   (0x3U << DDRPHYC_DDR3_MR0_BL_Pos)   /*!< 0x00000003 */
#define DDRPHYC_DDR3_MR0_BL       DDRPHYC_DDR3_MR0_BL_Msk             /*!< Burst length */
#define DDRPHYC_DDR3_MR0_BL_0     (0x1U << DDRPHYC_DDR3_MR0_BL_Pos)   /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR0_BL_1     (0x2U << DDRPHYC_DDR3_MR0_BL_Pos)   /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR0_CL0_Pos  (2U)
#define DDRPHYC_DDR3_MR0_CL0_Msk  (0x1U << DDRPHYC_DDR3_MR0_CL0_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR0_CL0      DDRPHYC_DDR3_MR0_CL0_Msk            /*!< CAS latency */
#define DDRPHYC_DDR3_MR0_BT_Pos   (3U)
#define DDRPHYC_DDR3_MR0_BT_Msk   (0x1U << DDRPHYC_DDR3_MR0_BT_Pos)   /*!< 0x00000008 */
#define DDRPHYC_DDR3_MR0_BT       DDRPHYC_DDR3_MR0_BT_Msk             /*!< Burst type */
#define DDRPHYC_DDR3_MR0_CL_Pos   (4U)
#define DDRPHYC_DDR3_MR0_CL_Msk   (0x7U << DDRPHYC_DDR3_MR0_CL_Pos)   /*!< 0x00000070 */
#define DDRPHYC_DDR3_MR0_CL       DDRPHYC_DDR3_MR0_CL_Msk             /*!< CAS latency */
#define DDRPHYC_DDR3_MR0_CL_0     (0x1U << DDRPHYC_DDR3_MR0_CL_Pos)   /*!< 0x00000010 */
#define DDRPHYC_DDR3_MR0_CL_1     (0x2U << DDRPHYC_DDR3_MR0_CL_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DDR3_MR0_CL_2     (0x4U << DDRPHYC_DDR3_MR0_CL_Pos)   /*!< 0x00000040 */
#define DDRPHYC_DDR3_MR0_TM_Pos   (7U)
#define DDRPHYC_DDR3_MR0_TM_Msk   (0x1U << DDRPHYC_DDR3_MR0_TM_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DDR3_MR0_TM       DDRPHYC_DDR3_MR0_TM_Msk             /*!< Operating mode */
#define DDRPHYC_DDR3_MR0_DR_Pos   (8U)
#define DDRPHYC_DDR3_MR0_DR_Msk   (0x1U << DDRPHYC_DDR3_MR0_DR_Pos)   /*!< 0x00000100 */
#define DDRPHYC_DDR3_MR0_DR       DDRPHYC_DDR3_MR0_DR_Msk             /*!< DLL reset (autoclear) */
#define DDRPHYC_DDR3_MR0_WR_Pos   (9U)
#define DDRPHYC_DDR3_MR0_WR_Msk   (0x7U << DDRPHYC_DDR3_MR0_WR_Pos)   /*!< 0x00000E00 */
#define DDRPHYC_DDR3_MR0_WR       DDRPHYC_DDR3_MR0_WR_Msk             /*!< Write recovery */
#define DDRPHYC_DDR3_MR0_WR_0     (0x1U << DDRPHYC_DDR3_MR0_WR_Pos)   /*!< 0x00000200 */
#define DDRPHYC_DDR3_MR0_WR_1     (0x2U << DDRPHYC_DDR3_MR0_WR_Pos)   /*!< 0x00000400 */
#define DDRPHYC_DDR3_MR0_WR_2     (0x4U << DDRPHYC_DDR3_MR0_WR_Pos)   /*!< 0x00000800 */
#define DDRPHYC_DDR3_MR0_PD_Pos   (12U)
#define DDRPHYC_DDR3_MR0_PD_Msk   (0x1U << DDRPHYC_DDR3_MR0_PD_Pos)   /*!< 0x00001000 */
#define DDRPHYC_DDR3_MR0_PD       DDRPHYC_DDR3_MR0_PD_Msk             /*!< Power-down control */
#define DDRPHYC_DDR3_MR0_RSVD_Pos (13U)
#define DDRPHYC_DDR3_MR0_RSVD_Msk (0x7U << DDRPHYC_DDR3_MR0_RSVD_Pos) /*!< 0x0000E000 */
#define DDRPHYC_DDR3_MR0_RSVD     DDRPHYC_DDR3_MR0_RSVD_Msk           /*!< JEDEC reserved. */
#define DDRPHYC_DDR3_MR0_RSVD_0   (0x1U << DDRPHYC_DDR3_MR0_RSVD_Pos) /*!< 0x00002000 */
#define DDRPHYC_DDR3_MR0_RSVD_1   (0x2U << DDRPHYC_DDR3_MR0_RSVD_Pos) /*!< 0x00004000 */
#define DDRPHYC_DDR3_MR0_RSVD_2   (0x4U << DDRPHYC_DDR3_MR0_RSVD_Pos) /*!< 0x00008000 */

/***************  Bit definition for DDRPHYC_DDR3_MR1 register  ***************/
#define DDRPHYC_DDR3_MR1_DE_Pos    (0U)
#define DDRPHYC_DDR3_MR1_DE_Msk    (0x1U << DDRPHYC_DDR3_MR1_DE_Pos)    /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR1_DE        DDRPHYC_DDR3_MR1_DE_Msk              /*!< DLL enable/disable */
#define DDRPHYC_DDR3_MR1_DIC0_Pos  (1U)
#define DDRPHYC_DDR3_MR1_DIC0_Msk  (0x1U << DDRPHYC_DDR3_MR1_DIC0_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR1_DIC0      DDRPHYC_DDR3_MR1_DIC0_Msk            /*!< Output driver impedance control */
#define DDRPHYC_DDR3_MR1_RTT0_Pos  (2U)
#define DDRPHYC_DDR3_MR1_RTT0_Msk  (0x1U << DDRPHYC_DDR3_MR1_RTT0_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR1_RTT0      DDRPHYC_DDR3_MR1_RTT0_Msk            /*!< On die termination */
#define DDRPHYC_DDR3_MR1_AL_Pos    (3U)
#define DDRPHYC_DDR3_MR1_AL_Msk    (0x3U << DDRPHYC_DDR3_MR1_AL_Pos)    /*!< 0x00000018 */
#define DDRPHYC_DDR3_MR1_AL        DDRPHYC_DDR3_MR1_AL_Msk              /*!< Posted CAS Additive Latency: */
#define DDRPHYC_DDR3_MR1_AL_0      (0x1U << DDRPHYC_DDR3_MR1_AL_Pos)    /*!< 0x00000008 */
#define DDRPHYC_DDR3_MR1_AL_1      (0x2U << DDRPHYC_DDR3_MR1_AL_Pos)    /*!< 0x00000010 */
#define DDRPHYC_DDR3_MR1_DIC1_Pos  (5U)
#define DDRPHYC_DDR3_MR1_DIC1_Msk  (0x1U << DDRPHYC_DDR3_MR1_DIC1_Pos)  /*!< 0x00000020 */
#define DDRPHYC_DDR3_MR1_DIC1      DDRPHYC_DDR3_MR1_DIC1_Msk            /*!< Output driver impedance control */
#define DDRPHYC_DDR3_MR1_RTT1_Pos  (6U)
#define DDRPHYC_DDR3_MR1_RTT1_Msk  (0x1U << DDRPHYC_DDR3_MR1_RTT1_Pos)  /*!< 0x00000040 */
#define DDRPHYC_DDR3_MR1_RTT1      DDRPHYC_DDR3_MR1_RTT1_Msk            /*!< On die termination */
#define DDRPHYC_DDR3_MR1_LEVEL_Pos (7U)
#define DDRPHYC_DDR3_MR1_LEVEL_Msk (0x1U << DDRPHYC_DDR3_MR1_LEVEL_Pos) /*!< 0x00000080 */
#define DDRPHYC_DDR3_MR1_LEVEL     DDRPHYC_DDR3_MR1_LEVEL_Msk           /*!< Write leveling enable (N/A) */
#define DDRPHYC_DDR3_MR1_RTT2_Pos  (9U)
#define DDRPHYC_DDR3_MR1_RTT2_Msk  (0x1U << DDRPHYC_DDR3_MR1_RTT2_Pos)  /*!< 0x00000200 */
#define DDRPHYC_DDR3_MR1_RTT2      DDRPHYC_DDR3_MR1_RTT2_Msk            /*!< On die termination */
#define DDRPHYC_DDR3_MR1_TDQS_Pos  (11U)
#define DDRPHYC_DDR3_MR1_TDQS_Msk  (0x1U << DDRPHYC_DDR3_MR1_TDQS_Pos)  /*!< 0x00000800 */
#define DDRPHYC_DDR3_MR1_TDQS      DDRPHYC_DDR3_MR1_TDQS_Msk            /*!< Termination data strobe */
#define DDRPHYC_DDR3_MR1_QOFF_Pos  (12U)
#define DDRPHYC_DDR3_MR1_QOFF_Msk  (0x1U << DDRPHYC_DDR3_MR1_QOFF_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DDR3_MR1_QOFF      DDRPHYC_DDR3_MR1_QOFF_Msk            /*!< Output enable/disable */
#define DDRPHYC_DDR3_MR1_BL_Pos    (0U)
#define DDRPHYC_DDR3_MR1_BL_Msk    (0x7U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000007 */
#define DDRPHYC_DDR3_MR1_BL        DDRPHYC_DDR3_MR1_BL_Msk              /*!< Burst length */
#define DDRPHYC_DDR3_MR1_BL_0      (0x1U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR1_BL_1      (0x2U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR1_BL_2      (0x4U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR1_BT_Pos    (3U)
#define DDRPHYC_DDR3_MR1_BT_Msk    (0x1U << DDRPHYC_DDR3_MR1_BT_Pos)    /*!< 0x00000008 */
#define DDRPHYC_DDR3_MR1_BT        DDRPHYC_DDR3_MR1_BT_Msk              /*!< Burst Type: Indicates whether a burst is sequential (0) or interleaved (1). , */
#define DDRPHYC_DDR3_MR1_WC_Pos    (4U)
#define DDRPHYC_DDR3_MR1_WC_Msk    (0x1U << DDRPHYC_DDR3_MR1_WC_Pos)    /*!< 0x00000010 */
#define DDRPHYC_DDR3_MR1_WC        DDRPHYC_DDR3_MR1_WC_Msk              /*!< Wrap control */
#define DDRPHYC_DDR3_MR1_NWR_Pos   (5U)
#define DDRPHYC_DDR3_MR1_NWR_Msk   (0x7U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x000000E0 */
#define DDRPHYC_DDR3_MR1_NWR       DDRPHYC_DDR3_MR1_NWR_Msk             /*!< Write recovery */
#define DDRPHYC_DDR3_MR1_NWR_0     (0x1U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DDR3_MR1_NWR_1     (0x2U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x00000040 */
#define DDRPHYC_DDR3_MR1_NWR_2     (0x4U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DDR3_MR1_BL_Pos    (0U)
#define DDRPHYC_DDR3_MR1_BL_Msk    (0x7U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000007 */
#define DDRPHYC_DDR3_MR1_BL        DDRPHYC_DDR3_MR1_BL_Msk              /*!< Burst length */
#define DDRPHYC_DDR3_MR1_BL_0      (0x1U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000001 */
#define DDRPHYC_DDR3_MR1_BL_1      (0x2U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000002 */
#define DDRPHYC_DDR3_MR1_BL_2      (0x4U << DDRPHYC_DDR3_MR1_BL_Pos)    /*!< 0x00000004 */
#define DDRPHYC_DDR3_MR1_NWR_Pos   (5U)
#define DDRPHYC_DDR3_MR1_NWR_Msk   (0x7U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x000000E0 */
#define DDRPHYC_DDR3_MR1_NWR       DDRPHYC_DDR3_MR1_NWR_Msk             /*!< Write recovery */
#define DDRPHYC_DDR3_MR1_NWR_0     (0x1U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DDR3_MR1_NWR_1     (0x2U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x00000040 */
#define DDRPHYC_DDR3_MR1_NWR_2     (0x4U << DDRPHYC_DDR3_MR1_NWR_Pos)   /*!< 0x00000080 */

