ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157cxx_cm4.h
/***************  Bit definition for RCC_UART78CKSELR register  ***************/
#define RCC_UART78CKSELR_UART78SRC_Pos            (0U)
#define RCC_UART78CKSELR_UART78SRC_Msk            (0x7U << RCC_UART78CKSELR_UART78SRC_Pos)           /*!< 0x00000007 */
#define RCC_UART78CKSELR_UART78SRC                RCC_UART78CKSELR_UART78SRC_Msk                     /*!< UART7 and UART8 kernel clock source selection */
#define RCC_UART78CKSELR_UART78SRC_0              (0x1U << RCC_UART78CKSELR_UART78SRC_Pos)           /*!< 0x00000001 */
#define RCC_UART78CKSELR_UART78SRC_1              (0x2U << RCC_UART78CKSELR_UART78SRC_Pos)           /*!< 0x00000002 */
#define RCC_UART78CKSELR_UART78SRC_2              (0x4U << RCC_UART78CKSELR_UART78SRC_Pos)           /*!< 0x00000004 */

/**************  Bit definition for RCC_SDMMC12CKSELR register  ***************/
#define RCC_SDMMC12CKSELR_SDMMC12SRC_Pos          (0U)
#define RCC_SDMMC12CKSELR_SDMMC12SRC_Msk          (0x7U << RCC_SDMMC12CKSELR_SDMMC12SRC_Pos)         /*!< 0x00000007 */
#define RCC_SDMMC12CKSELR_SDMMC12SRC              RCC_SDMMC12CKSELR_SDMMC12SRC_Msk                   /*!< SDMMC1 and SDMMC2 kernel clock source selection */
#define RCC_SDMMC12CKSELR_SDMMC12SRC_0            (0x1U << RCC_SDMMC12CKSELR_SDMMC12SRC_Pos)         /*!< 0x00000001 */
#define RCC_SDMMC12CKSELR_SDMMC12SRC_1            (0x2U << RCC_SDMMC12CKSELR_SDMMC12SRC_Pos)         /*!< 0x00000002 */
#define RCC_SDMMC12CKSELR_SDMMC12SRC_2            (0x4U << RCC_SDMMC12CKSELR_SDMMC12SRC_Pos)         /*!< 0x00000004 */

/***************  Bit definition for RCC_SDMMC3CKSELR register  ***************/
#define RCC_SDMMC3CKSELR_SDMMC3SRC_Pos            (0U)
#define RCC_SDMMC3CKSELR_SDMMC3SRC_Msk            (0x7U << RCC_SDMMC3CKSELR_SDMMC3SRC_Pos)           /*!< 0x00000007 */
#define RCC_SDMMC3CKSELR_SDMMC3SRC                RCC_SDMMC3CKSELR_SDMMC3SRC_Msk                     /*!< SDMMC3 kernel clock source selection */
#define RCC_SDMMC3CKSELR_SDMMC3SRC_0              (0x1U << RCC_SDMMC3CKSELR_SDMMC3SRC_Pos)           /*!< 0x00000001 */
#define RCC_SDMMC3CKSELR_SDMMC3SRC_1              (0x2U << RCC_SDMMC3CKSELR_SDMMC3SRC_Pos)           /*!< 0x00000002 */
#define RCC_SDMMC3CKSELR_SDMMC3SRC_2              (0x4U << RCC_SDMMC3CKSELR_SDMMC3SRC_Pos)           /*!< 0x00000004 */

/****************  Bit definition for RCC_ETHCKSELR register  *****************/
#define RCC_ETHCKSELR_ETHSRC_Pos                  (0U)
#define RCC_ETHCKSELR_ETHSRC_Msk                  (0x3U << RCC_ETHCKSELR_ETHSRC_Pos)                 /*!< 0x00000003 */
#define RCC_ETHCKSELR_ETHSRC                      RCC_ETHCKSELR_ETHSRC_Msk                           /*!< ETH kernel clock source selection */
#define RCC_ETHCKSELR_ETHSRC_0                    (0x1U << RCC_ETHCKSELR_ETHSRC_Pos)                 /*!< 0x00000001 */
#define RCC_ETHCKSELR_ETHSRC_1                    (0x2U << RCC_ETHCKSELR_ETHSRC_Pos)                 /*!< 0x00000002 */
#define RCC_ETHCKSELR_ETHPTPDIV_Pos               (4U)
#define RCC_ETHCKSELR_ETHPTPDIV_Msk               (0xFU << RCC_ETHCKSELR_ETHPTPDIV_Pos)              /*!< 0x000000F0 */
#define RCC_ETHCKSELR_ETHPTPDIV                   RCC_ETHCKSELR_ETHPTPDIV_Msk                        /*!< Clock divider for Ethernet Precision Time Protocol (PTP) */
#define RCC_ETHCKSELR_ETHPTPDIV_0                 (0x1U << RCC_ETHCKSELR_ETHPTPDIV_Pos)             /*!< 0x00000010 */
#define RCC_ETHCKSELR_ETHPTPDIV_1                 (0x2U << RCC_ETHCKSELR_ETHPTPDIV_Pos)             /*!< 0x00000020 */
#define RCC_ETHCKSELR_ETHPTPDIV_2                 (0x4U << RCC_ETHCKSELR_ETHPTPDIV_Pos)             /*!< 0x00000040 */
#define RCC_ETHCKSELR_ETHPTPDIV_3                 (0x8U << RCC_ETHCKSELR_ETHPTPDIV_Pos)             /*!< 0x00000080 */

/****************  Bit definition for RCC_QSPICKSELR register  ****************/
#define RCC_QSPICKSELR_QSPISRC_Pos                (0U)
#define RCC_QSPICKSELR_QSPISRC_Msk                (0x3U << RCC_QSPICKSELR_QSPISRC_Pos)               /*!< 0x00000003 */
#define RCC_QSPICKSELR_QSPISRC                    RCC_QSPICKSELR_QSPISRC_Msk                         /*!< QUADSPI kernel clock source selection */
#define RCC_QSPICKSELR_QSPISRC_0                  (0x1U << RCC_QSPICKSELR_QSPISRC_Pos)               /*!< 0x00000001 */
#define RCC_QSPICKSELR_QSPISRC_1                  (0x2U << RCC_QSPICKSELR_QSPISRC_Pos)               /*!< 0x00000002 */

/****************  Bit definition for RCC_FMCCKSELR register  *****************/
#define RCC_FMCCKSELR_FMCSRC_Pos                  (0U)
#define RCC_FMCCKSELR_FMCSRC_Msk                  (0x3U << RCC_FMCCKSELR_FMCSRC_Pos)                 /*!< 0x00000003 */
#define RCC_FMCCKSELR_FMCSRC                      RCC_FMCCKSELR_FMCSRC_Msk                           /*!< FMC kernel clock source selection */
#define RCC_FMCCKSELR_FMCSRC_0                    (0x1U << RCC_FMCCKSELR_FMCSRC_Pos)                 /*!< 0x00000001 */
#define RCC_FMCCKSELR_FMCSRC_1                    (0x2U << RCC_FMCCKSELR_FMCSRC_Pos)                 /*!< 0x00000002 */

/***************  Bit definition for RCC_FDCANCKSELR register  ****************/
#define RCC_FDCANCKSELR_FDCANSRC_Pos              (0U)
#define RCC_FDCANCKSELR_FDCANSRC_Msk              (0x3U << RCC_FDCANCKSELR_FDCANSRC_Pos)             /*!< 0x00000003 */
#define RCC_FDCANCKSELR_FDCANSRC                  RCC_FDCANCKSELR_FDCANSRC_Msk                       /*!< FDCAN kernel clock source selection */
#define RCC_FDCANCKSELR_FDCANSRC_0                (0x1U << RCC_FDCANCKSELR_FDCANSRC_Pos)             /*!< 0x00000001 */
#define RCC_FDCANCKSELR_FDCANSRC_1                (0x2U << RCC_FDCANCKSELR_FDCANSRC_Pos)             /*!< 0x00000002 */

/***************  Bit definition for RCC_SPDIFCKSELR register  ****************/
#define RCC_SPDIFCKSELR_SPDIFSRC_Pos              (0U)
#define RCC_SPDIFCKSELR_SPDIFSRC_Msk              (0x3U << RCC_SPDIFCKSELR_SPDIFSRC_Pos)             /*!< 0x00000003 */
#define RCC_SPDIFCKSELR_SPDIFSRC                  RCC_SPDIFCKSELR_SPDIFSRC_Msk                       /*!< SPDIFRX kernel clock source selection */
#define RCC_SPDIFCKSELR_SPDIFSRC_0                (0x1U << RCC_SPDIFCKSELR_SPDIFSRC_Pos)             /*!< 0x00000001 */
#define RCC_SPDIFCKSELR_SPDIFSRC_1                (0x2U << RCC_SPDIFCKSELR_SPDIFSRC_Pos)             /*!< 0x00000002 */

/****************  Bit definition for RCC_CECCKSELR register  *****************/
#define RCC_CECCKSELR_CECSRC_Pos                  (0U)
#define RCC_CECCKSELR_CECSRC_Msk                  (0x3U << RCC_CECCKSELR_CECSRC_Pos)                 /*!< 0x00000003 */
#define RCC_CECCKSELR_CECSRC                      RCC_CECCKSELR_CECSRC_Msk                           /*!< CEC-HDMI kernel clock source selection */
#define RCC_CECCKSELR_CECSRC_0                    (0x1U << RCC_CECCKSELR_CECSRC_Pos)                 /*!< 0x00000001 */
#define RCC_CECCKSELR_CECSRC_1                    (0x2U << RCC_CECCKSELR_CECSRC_Pos)                 /*!< 0x00000002 */

/****************  Bit definition for RCC_USBCKSELR register  *****************/
#define RCC_USBCKSELR_USBPHYSRC_Pos               (0U)
#define RCC_USBCKSELR_USBPHYSRC_Msk               (0x3U << RCC_USBCKSELR_USBPHYSRC_Pos)              /*!< 0x00000003 */
#define RCC_USBCKSELR_USBPHYSRC                   RCC_USBCKSELR_USBPHYSRC_Msk                        /*!< USB PHY kernel clock source selection */
#define RCC_USBCKSELR_USBPHYSRC_0                 (0x1U << RCC_USBCKSELR_USBPHYSRC_Pos)              /*!< 0x00000001 */
#define RCC_USBCKSELR_USBPHYSRC_1                 (0x2U << RCC_USBCKSELR_USBPHYSRC_Pos)              /*!< 0x00000002 */
#define RCC_USBCKSELR_USBOSRC_Pos                 (4U)
#define RCC_USBCKSELR_USBOSRC_Msk                 (0x1U << RCC_USBCKSELR_USBOSRC_Pos)                /*!< 0x00000010 */
#define RCC_USBCKSELR_USBOSRC                     RCC_USBCKSELR_USBOSRC_Msk                          /*!< USB OTG kernel clock source selection */

/****************  Bit definition for RCC_RNG2CKSELR register  ****************/
#define RCC_RNG2CKSELR_RNG2SRC_Pos                (0U)
#define RCC_RNG2CKSELR_RNG2SRC_Msk                (0x3U << RCC_RNG2CKSELR_RNG2SRC_Pos)               /*!< 0x00000003 */
#define RCC_RNG2CKSELR_RNG2SRC                    RCC_RNG2CKSELR_RNG2SRC_Msk                         /*!< RNG2 kernel clock source selection */
#define RCC_RNG2CKSELR_RNG2SRC_0                  (0x1U << RCC_RNG2CKSELR_RNG2SRC_Pos)               /*!< 0x00000001 */
#define RCC_RNG2CKSELR_RNG2SRC_1                  (0x2U << RCC_RNG2CKSELR_RNG2SRC_Pos)               /*!< 0x00000002 */

/****************  Bit definition for RCC_DSICKSELR register  *****************/
#define RCC_DSICKSELR_DSISRC_Pos                  (0U)
#define RCC_DSICKSELR_DSISRC_Msk                  (0x1U << RCC_DSICKSELR_DSISRC_Pos)                 /*!< 0x00000001 */
#define RCC_DSICKSELR_DSISRC                      RCC_DSICKSELR_DSISRC_Msk                           /*!< DSI kernel clock source selection */

