ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157cxx_cm4.h
/*************  Bit definition for RCC_MP_MLAHBLPENCLRR register  *************/
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Pos        (0U)
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Msk        (0x1U << RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN            RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Msk                 /*!< SRAM1 interface clock enable during CSleep mode */
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Pos        (1U)
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Msk        (0x1U << RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Pos)       /*!< 0x00000002 */
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN            RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Msk                 /*!< SRAM2 interface clock enable during CSleep mode */
#define RCC_MP_MLAHBLPENCLRR_SRAM34LPEN_Pos       (2U)
#define RCC_MP_MLAHBLPENCLRR_SRAM34LPEN_Msk       (0x1U << RCC_MP_MLAHBLPENCLRR_SRAM34LPEN_Pos)      /*!< 0x00000004 */
#define RCC_MP_MLAHBLPENCLRR_SRAM34LPEN           RCC_MP_MLAHBLPENCLRR_SRAM34LPEN_Msk                /*!< SRAM3 and SRAM4 interface clock enable during CSleep mode */
#define RCC_MP_MLAHBLPENCLRR_RETRAMLPEN_Pos       (4U)
#define RCC_MP_MLAHBLPENCLRR_RETRAMLPEN_Msk       (0x1U << RCC_MP_MLAHBLPENCLRR_RETRAMLPEN_Pos)      /*!< 0x00000010 */
#define RCC_MP_MLAHBLPENCLRR_RETRAMLPEN           RCC_MP_MLAHBLPENCLRR_RETRAMLPEN_Msk                /*!< RETRAM interface clock enable during CSleep mode */

/*************  Bit definition for RCC_MC_APB1LPENSETR register  **************/
#define RCC_MC_APB1LPENSETR_TIM2LPEN_Pos          (0U)
#define RCC_MC_APB1LPENSETR_TIM2LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_TIM2LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_APB1LPENSETR_TIM2LPEN              RCC_MC_APB1LPENSETR_TIM2LPEN_Msk                   /*!< TIM2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM3LPEN_Pos          (1U)
#define RCC_MC_APB1LPENSETR_TIM3LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_TIM3LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MC_APB1LPENSETR_TIM3LPEN              RCC_MC_APB1LPENSETR_TIM3LPEN_Msk                   /*!< TIM3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM4LPEN_Pos          (2U)
#define RCC_MC_APB1LPENSETR_TIM4LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_TIM4LPEN_Pos)         /*!< 0x00000004 */
#define RCC_MC_APB1LPENSETR_TIM4LPEN              RCC_MC_APB1LPENSETR_TIM4LPEN_Msk                   /*!< TIM4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM5LPEN_Pos          (3U)
#define RCC_MC_APB1LPENSETR_TIM5LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_TIM5LPEN_Pos)         /*!< 0x00000008 */
#define RCC_MC_APB1LPENSETR_TIM5LPEN              RCC_MC_APB1LPENSETR_TIM5LPEN_Msk                   /*!< TIM5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM6LPEN_Pos          (4U)
#define RCC_MC_APB1LPENSETR_TIM6LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_TIM6LPEN_Pos)         /*!< 0x00000010 */
#define RCC_MC_APB1LPENSETR_TIM6LPEN              RCC_MC_APB1LPENSETR_TIM6LPEN_Msk                   /*!< TIM6 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM7LPEN_Pos          (5U)
#define RCC_MC_APB1LPENSETR_TIM7LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_TIM7LPEN_Pos)         /*!< 0x00000020 */
#define RCC_MC_APB1LPENSETR_TIM7LPEN              RCC_MC_APB1LPENSETR_TIM7LPEN_Msk                   /*!< TIM7 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM12LPEN_Pos         (6U)
#define RCC_MC_APB1LPENSETR_TIM12LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_TIM12LPEN_Pos)        /*!< 0x00000040 */
#define RCC_MC_APB1LPENSETR_TIM12LPEN             RCC_MC_APB1LPENSETR_TIM12LPEN_Msk                  /*!< TIM12 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM13LPEN_Pos         (7U)
#define RCC_MC_APB1LPENSETR_TIM13LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_TIM13LPEN_Pos)        /*!< 0x00000080 */
#define RCC_MC_APB1LPENSETR_TIM13LPEN             RCC_MC_APB1LPENSETR_TIM13LPEN_Msk                  /*!< TIM13 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_TIM14LPEN_Pos         (8U)
#define RCC_MC_APB1LPENSETR_TIM14LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_TIM14LPEN_Pos)        /*!< 0x00000100 */
#define RCC_MC_APB1LPENSETR_TIM14LPEN             RCC_MC_APB1LPENSETR_TIM14LPEN_Msk                  /*!< TIM14 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_LPTIM1LPEN_Pos        (9U)
#define RCC_MC_APB1LPENSETR_LPTIM1LPEN_Msk        (0x1U << RCC_MC_APB1LPENSETR_LPTIM1LPEN_Pos)       /*!< 0x00000200 */
#define RCC_MC_APB1LPENSETR_LPTIM1LPEN            RCC_MC_APB1LPENSETR_LPTIM1LPEN_Msk                 /*!< LPTIM1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_SPI2LPEN_Pos          (11U)
#define RCC_MC_APB1LPENSETR_SPI2LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_SPI2LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MC_APB1LPENSETR_SPI2LPEN              RCC_MC_APB1LPENSETR_SPI2LPEN_Msk                   /*!< SPI2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_SPI3LPEN_Pos          (12U)
#define RCC_MC_APB1LPENSETR_SPI3LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_SPI3LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MC_APB1LPENSETR_SPI3LPEN              RCC_MC_APB1LPENSETR_SPI3LPEN_Msk                   /*!< SPI3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_USART2LPEN_Pos        (14U)
#define RCC_MC_APB1LPENSETR_USART2LPEN_Msk        (0x1U << RCC_MC_APB1LPENSETR_USART2LPEN_Pos)       /*!< 0x00004000 */
#define RCC_MC_APB1LPENSETR_USART2LPEN            RCC_MC_APB1LPENSETR_USART2LPEN_Msk                 /*!< USART2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_USART3LPEN_Pos        (15U)
#define RCC_MC_APB1LPENSETR_USART3LPEN_Msk        (0x1U << RCC_MC_APB1LPENSETR_USART3LPEN_Pos)       /*!< 0x00008000 */
#define RCC_MC_APB1LPENSETR_USART3LPEN            RCC_MC_APB1LPENSETR_USART3LPEN_Msk                 /*!< USART3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_UART4LPEN_Pos         (16U)
#define RCC_MC_APB1LPENSETR_UART4LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_UART4LPEN_Pos)        /*!< 0x00010000 */
#define RCC_MC_APB1LPENSETR_UART4LPEN             RCC_MC_APB1LPENSETR_UART4LPEN_Msk                  /*!< UART4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_UART5LPEN_Pos         (17U)
#define RCC_MC_APB1LPENSETR_UART5LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_UART5LPEN_Pos)        /*!< 0x00020000 */
#define RCC_MC_APB1LPENSETR_UART5LPEN             RCC_MC_APB1LPENSETR_UART5LPEN_Msk                  /*!< UART5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_UART7LPEN_Pos         (18U)
#define RCC_MC_APB1LPENSETR_UART7LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_UART7LPEN_Pos)        /*!< 0x00040000 */
#define RCC_MC_APB1LPENSETR_UART7LPEN             RCC_MC_APB1LPENSETR_UART7LPEN_Msk                  /*!< UART7 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_UART8LPEN_Pos         (19U)
#define RCC_MC_APB1LPENSETR_UART8LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_UART8LPEN_Pos)        /*!< 0x00080000 */
#define RCC_MC_APB1LPENSETR_UART8LPEN             RCC_MC_APB1LPENSETR_UART8LPEN_Msk                  /*!< UART8 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_I2C1LPEN_Pos          (21U)
#define RCC_MC_APB1LPENSETR_I2C1LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_I2C1LPEN_Pos)         /*!< 0x00200000 */
#define RCC_MC_APB1LPENSETR_I2C1LPEN              RCC_MC_APB1LPENSETR_I2C1LPEN_Msk                   /*!< I2C1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_I2C2LPEN_Pos          (22U)
#define RCC_MC_APB1LPENSETR_I2C2LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_I2C2LPEN_Pos)         /*!< 0x00400000 */
#define RCC_MC_APB1LPENSETR_I2C2LPEN              RCC_MC_APB1LPENSETR_I2C2LPEN_Msk                   /*!< I2C2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_I2C3LPEN_Pos          (23U)
#define RCC_MC_APB1LPENSETR_I2C3LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_I2C3LPEN_Pos)         /*!< 0x00800000 */
#define RCC_MC_APB1LPENSETR_I2C3LPEN              RCC_MC_APB1LPENSETR_I2C3LPEN_Msk                   /*!< I2C3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_I2C5LPEN_Pos          (24U)
#define RCC_MC_APB1LPENSETR_I2C5LPEN_Msk          (0x1U << RCC_MC_APB1LPENSETR_I2C5LPEN_Pos)         /*!< 0x01000000 */
#define RCC_MC_APB1LPENSETR_I2C5LPEN              RCC_MC_APB1LPENSETR_I2C5LPEN_Msk                   /*!< I2C5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_SPDIFLPEN_Pos         (26U)
#define RCC_MC_APB1LPENSETR_SPDIFLPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_SPDIFLPEN_Pos)        /*!< 0x04000000 */
#define RCC_MC_APB1LPENSETR_SPDIFLPEN             RCC_MC_APB1LPENSETR_SPDIFLPEN_Msk                  /*!< SPDIFRX peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_CECLPEN_Pos           (27U)
#define RCC_MC_APB1LPENSETR_CECLPEN_Msk           (0x1U << RCC_MC_APB1LPENSETR_CECLPEN_Pos)          /*!< 0x08000000 */
#define RCC_MC_APB1LPENSETR_CECLPEN               RCC_MC_APB1LPENSETR_CECLPEN_Msk                    /*!< HDMI-CEC peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_WWDG1LPEN_Pos         (28U)
#define RCC_MC_APB1LPENSETR_WWDG1LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_WWDG1LPEN_Pos)        /*!< 0x10000000 */
#define RCC_MC_APB1LPENSETR_WWDG1LPEN             RCC_MC_APB1LPENSETR_WWDG1LPEN_Msk                  /*!< WWDG1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_DAC12LPEN_Pos         (29U)
#define RCC_MC_APB1LPENSETR_DAC12LPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_DAC12LPEN_Pos)        /*!< 0x20000000 */
#define RCC_MC_APB1LPENSETR_DAC12LPEN             RCC_MC_APB1LPENSETR_DAC12LPEN_Msk                  /*!< DAC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENSETR_MDIOSLPEN_Pos         (31U)
#define RCC_MC_APB1LPENSETR_MDIOSLPEN_Msk         (0x1U << RCC_MC_APB1LPENSETR_MDIOSLPEN_Pos)        /*!< 0x80000000 */
#define RCC_MC_APB1LPENSETR_MDIOSLPEN             RCC_MC_APB1LPENSETR_MDIOSLPEN_Msk                  /*!< MDIOS peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_APB1LPENCLRR register  **************/
#define RCC_MC_APB1LPENCLRR_TIM2LPEN_Pos          (0U)
#define RCC_MC_APB1LPENCLRR_TIM2LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_TIM2LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_APB1LPENCLRR_TIM2LPEN              RCC_MC_APB1LPENCLRR_TIM2LPEN_Msk                   /*!< TIM2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM3LPEN_Pos          (1U)
#define RCC_MC_APB1LPENCLRR_TIM3LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_TIM3LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MC_APB1LPENCLRR_TIM3LPEN              RCC_MC_APB1LPENCLRR_TIM3LPEN_Msk                   /*!< TIM3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM4LPEN_Pos          (2U)
#define RCC_MC_APB1LPENCLRR_TIM4LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_TIM4LPEN_Pos)         /*!< 0x00000004 */
#define RCC_MC_APB1LPENCLRR_TIM4LPEN              RCC_MC_APB1LPENCLRR_TIM4LPEN_Msk                   /*!< TIM4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM5LPEN_Pos          (3U)
#define RCC_MC_APB1LPENCLRR_TIM5LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_TIM5LPEN_Pos)         /*!< 0x00000008 */
#define RCC_MC_APB1LPENCLRR_TIM5LPEN              RCC_MC_APB1LPENCLRR_TIM5LPEN_Msk                   /*!< TIM5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM6LPEN_Pos          (4U)
#define RCC_MC_APB1LPENCLRR_TIM6LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_TIM6LPEN_Pos)         /*!< 0x00000010 */
#define RCC_MC_APB1LPENCLRR_TIM6LPEN              RCC_MC_APB1LPENCLRR_TIM6LPEN_Msk                   /*!< TIM6 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM7LPEN_Pos          (5U)
#define RCC_MC_APB1LPENCLRR_TIM7LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_TIM7LPEN_Pos)         /*!< 0x00000020 */
#define RCC_MC_APB1LPENCLRR_TIM7LPEN              RCC_MC_APB1LPENCLRR_TIM7LPEN_Msk                   /*!< TIM7 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM12LPEN_Pos         (6U)
#define RCC_MC_APB1LPENCLRR_TIM12LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_TIM12LPEN_Pos)        /*!< 0x00000040 */
#define RCC_MC_APB1LPENCLRR_TIM12LPEN             RCC_MC_APB1LPENCLRR_TIM12LPEN_Msk                  /*!< TIM12 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM13LPEN_Pos         (7U)
#define RCC_MC_APB1LPENCLRR_TIM13LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_TIM13LPEN_Pos)        /*!< 0x00000080 */
#define RCC_MC_APB1LPENCLRR_TIM13LPEN             RCC_MC_APB1LPENCLRR_TIM13LPEN_Msk                  /*!< TIM13 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_TIM14LPEN_Pos         (8U)
#define RCC_MC_APB1LPENCLRR_TIM14LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_TIM14LPEN_Pos)        /*!< 0x00000100 */
#define RCC_MC_APB1LPENCLRR_TIM14LPEN             RCC_MC_APB1LPENCLRR_TIM14LPEN_Msk                  /*!< TIM14 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_LPTIM1LPEN_Pos        (9U)
#define RCC_MC_APB1LPENCLRR_LPTIM1LPEN_Msk        (0x1U << RCC_MC_APB1LPENCLRR_LPTIM1LPEN_Pos)       /*!< 0x00000200 */
#define RCC_MC_APB1LPENCLRR_LPTIM1LPEN            RCC_MC_APB1LPENCLRR_LPTIM1LPEN_Msk                 /*!< LPTIM1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_SPI2LPEN_Pos          (11U)
#define RCC_MC_APB1LPENCLRR_SPI2LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_SPI2LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MC_APB1LPENCLRR_SPI2LPEN              RCC_MC_APB1LPENCLRR_SPI2LPEN_Msk                   /*!< SPI2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_SPI3LPEN_Pos          (12U)
#define RCC_MC_APB1LPENCLRR_SPI3LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_SPI3LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MC_APB1LPENCLRR_SPI3LPEN              RCC_MC_APB1LPENCLRR_SPI3LPEN_Msk                   /*!< SPI3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_USART2LPEN_Pos        (14U)
#define RCC_MC_APB1LPENCLRR_USART2LPEN_Msk        (0x1U << RCC_MC_APB1LPENCLRR_USART2LPEN_Pos)       /*!< 0x00004000 */
#define RCC_MC_APB1LPENCLRR_USART2LPEN            RCC_MC_APB1LPENCLRR_USART2LPEN_Msk                 /*!< USART2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_USART3LPEN_Pos        (15U)
#define RCC_MC_APB1LPENCLRR_USART3LPEN_Msk        (0x1U << RCC_MC_APB1LPENCLRR_USART3LPEN_Pos)       /*!< 0x00008000 */
#define RCC_MC_APB1LPENCLRR_USART3LPEN            RCC_MC_APB1LPENCLRR_USART3LPEN_Msk                 /*!< USART3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_UART4LPEN_Pos         (16U)
#define RCC_MC_APB1LPENCLRR_UART4LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_UART4LPEN_Pos)        /*!< 0x00010000 */
#define RCC_MC_APB1LPENCLRR_UART4LPEN             RCC_MC_APB1LPENCLRR_UART4LPEN_Msk                  /*!< UART4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_UART5LPEN_Pos         (17U)
#define RCC_MC_APB1LPENCLRR_UART5LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_UART5LPEN_Pos)        /*!< 0x00020000 */
#define RCC_MC_APB1LPENCLRR_UART5LPEN             RCC_MC_APB1LPENCLRR_UART5LPEN_Msk                  /*!< UART5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_UART7LPEN_Pos         (18U)
#define RCC_MC_APB1LPENCLRR_UART7LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_UART7LPEN_Pos)        /*!< 0x00040000 */
#define RCC_MC_APB1LPENCLRR_UART7LPEN             RCC_MC_APB1LPENCLRR_UART7LPEN_Msk                  /*!< UART7 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_UART8LPEN_Pos         (19U)
#define RCC_MC_APB1LPENCLRR_UART8LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_UART8LPEN_Pos)        /*!< 0x00080000 */
#define RCC_MC_APB1LPENCLRR_UART8LPEN             RCC_MC_APB1LPENCLRR_UART8LPEN_Msk                  /*!< UART8 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_I2C1LPEN_Pos          (21U)
#define RCC_MC_APB1LPENCLRR_I2C1LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_I2C1LPEN_Pos)         /*!< 0x00200000 */
#define RCC_MC_APB1LPENCLRR_I2C1LPEN              RCC_MC_APB1LPENCLRR_I2C1LPEN_Msk                   /*!< I2C1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_I2C2LPEN_Pos          (22U)
#define RCC_MC_APB1LPENCLRR_I2C2LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_I2C2LPEN_Pos)         /*!< 0x00400000 */
#define RCC_MC_APB1LPENCLRR_I2C2LPEN              RCC_MC_APB1LPENCLRR_I2C2LPEN_Msk                   /*!< I2C2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_I2C3LPEN_Pos          (23U)
#define RCC_MC_APB1LPENCLRR_I2C3LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_I2C3LPEN_Pos)         /*!< 0x00800000 */
#define RCC_MC_APB1LPENCLRR_I2C3LPEN              RCC_MC_APB1LPENCLRR_I2C3LPEN_Msk                   /*!< I2C3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_I2C5LPEN_Pos          (24U)
#define RCC_MC_APB1LPENCLRR_I2C5LPEN_Msk          (0x1U << RCC_MC_APB1LPENCLRR_I2C5LPEN_Pos)         /*!< 0x01000000 */
#define RCC_MC_APB1LPENCLRR_I2C5LPEN              RCC_MC_APB1LPENCLRR_I2C5LPEN_Msk                   /*!< I2C5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_SPDIFLPEN_Pos         (26U)
#define RCC_MC_APB1LPENCLRR_SPDIFLPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_SPDIFLPEN_Pos)        /*!< 0x04000000 */
#define RCC_MC_APB1LPENCLRR_SPDIFLPEN             RCC_MC_APB1LPENCLRR_SPDIFLPEN_Msk                  /*!< SPDIFRX peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_CECLPEN_Pos           (27U)
#define RCC_MC_APB1LPENCLRR_CECLPEN_Msk           (0x1U << RCC_MC_APB1LPENCLRR_CECLPEN_Pos)          /*!< 0x08000000 */
#define RCC_MC_APB1LPENCLRR_CECLPEN               RCC_MC_APB1LPENCLRR_CECLPEN_Msk                    /*!< HDMI-CEC peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_WWDG1LPEN_Pos         (28U)
#define RCC_MC_APB1LPENCLRR_WWDG1LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_WWDG1LPEN_Pos)        /*!< 0x10000000 */
#define RCC_MC_APB1LPENCLRR_WWDG1LPEN             RCC_MC_APB1LPENCLRR_WWDG1LPEN_Msk                  /*!< WWDG1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_DAC12LPEN_Pos         (29U)
#define RCC_MC_APB1LPENCLRR_DAC12LPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_DAC12LPEN_Pos)        /*!< 0x20000000 */
#define RCC_MC_APB1LPENCLRR_DAC12LPEN             RCC_MC_APB1LPENCLRR_DAC12LPEN_Msk                  /*!< DAC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB1LPENCLRR_MDIOSLPEN_Pos         (31U)
#define RCC_MC_APB1LPENCLRR_MDIOSLPEN_Msk         (0x1U << RCC_MC_APB1LPENCLRR_MDIOSLPEN_Pos)        /*!< 0x80000000 */
#define RCC_MC_APB1LPENCLRR_MDIOSLPEN             RCC_MC_APB1LPENCLRR_MDIOSLPEN_Msk                  /*!< MDIOS peripheral clocks enable during CSleep mode */

