ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157cxx_cm4.h
/*************  Bit definition for RCC_MC_APB2LPENSETR register  **************/
#define RCC_MC_APB2LPENSETR_TIM1LPEN_Pos          (0U)
#define RCC_MC_APB2LPENSETR_TIM1LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_TIM1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_APB2LPENSETR_TIM1LPEN              RCC_MC_APB2LPENSETR_TIM1LPEN_Msk                   /*!< TIM1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_TIM8LPEN_Pos          (1U)
#define RCC_MC_APB2LPENSETR_TIM8LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_TIM8LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MC_APB2LPENSETR_TIM8LPEN              RCC_MC_APB2LPENSETR_TIM8LPEN_Msk                   /*!< TIM8 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_TIM15LPEN_Pos         (2U)
#define RCC_MC_APB2LPENSETR_TIM15LPEN_Msk         (0x1U << RCC_MC_APB2LPENSETR_TIM15LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MC_APB2LPENSETR_TIM15LPEN             RCC_MC_APB2LPENSETR_TIM15LPEN_Msk                  /*!< TIM15 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_TIM16LPEN_Pos         (3U)
#define RCC_MC_APB2LPENSETR_TIM16LPEN_Msk         (0x1U << RCC_MC_APB2LPENSETR_TIM16LPEN_Pos)        /*!< 0x00000008 */
#define RCC_MC_APB2LPENSETR_TIM16LPEN             RCC_MC_APB2LPENSETR_TIM16LPEN_Msk                  /*!< TIM16 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_TIM17LPEN_Pos         (4U)
#define RCC_MC_APB2LPENSETR_TIM17LPEN_Msk         (0x1U << RCC_MC_APB2LPENSETR_TIM17LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MC_APB2LPENSETR_TIM17LPEN             RCC_MC_APB2LPENSETR_TIM17LPEN_Msk                  /*!< TIM17 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_SPI1LPEN_Pos          (8U)
#define RCC_MC_APB2LPENSETR_SPI1LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_SPI1LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_APB2LPENSETR_SPI1LPEN              RCC_MC_APB2LPENSETR_SPI1LPEN_Msk                   /*!< SPI/I2S1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_SPI4LPEN_Pos          (9U)
#define RCC_MC_APB2LPENSETR_SPI4LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_SPI4LPEN_Pos)         /*!< 0x00000200 */
#define RCC_MC_APB2LPENSETR_SPI4LPEN              RCC_MC_APB2LPENSETR_SPI4LPEN_Msk                   /*!< SPI4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_SPI5LPEN_Pos          (10U)
#define RCC_MC_APB2LPENSETR_SPI5LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_SPI5LPEN_Pos)         /*!< 0x00000400 */
#define RCC_MC_APB2LPENSETR_SPI5LPEN              RCC_MC_APB2LPENSETR_SPI5LPEN_Msk                   /*!< SPI5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_USART6LPEN_Pos        (13U)
#define RCC_MC_APB2LPENSETR_USART6LPEN_Msk        (0x1U << RCC_MC_APB2LPENSETR_USART6LPEN_Pos)       /*!< 0x00002000 */
#define RCC_MC_APB2LPENSETR_USART6LPEN            RCC_MC_APB2LPENSETR_USART6LPEN_Msk                 /*!< USART6 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_SAI1LPEN_Pos          (16U)
#define RCC_MC_APB2LPENSETR_SAI1LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_SAI1LPEN_Pos)         /*!< 0x00010000 */
#define RCC_MC_APB2LPENSETR_SAI1LPEN              RCC_MC_APB2LPENSETR_SAI1LPEN_Msk                   /*!< SAI1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_SAI2LPEN_Pos          (17U)
#define RCC_MC_APB2LPENSETR_SAI2LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_SAI2LPEN_Pos)         /*!< 0x00020000 */
#define RCC_MC_APB2LPENSETR_SAI2LPEN              RCC_MC_APB2LPENSETR_SAI2LPEN_Msk                   /*!< SAI2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_SAI3LPEN_Pos          (18U)
#define RCC_MC_APB2LPENSETR_SAI3LPEN_Msk          (0x1U << RCC_MC_APB2LPENSETR_SAI3LPEN_Pos)         /*!< 0x00040000 */
#define RCC_MC_APB2LPENSETR_SAI3LPEN              RCC_MC_APB2LPENSETR_SAI3LPEN_Msk                   /*!< SAI3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_DFSDMLPEN_Pos         (20U)
#define RCC_MC_APB2LPENSETR_DFSDMLPEN_Msk         (0x1U << RCC_MC_APB2LPENSETR_DFSDMLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MC_APB2LPENSETR_DFSDMLPEN             RCC_MC_APB2LPENSETR_DFSDMLPEN_Msk                  /*!< DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_ADFSDMLPEN_Pos        (21U)
#define RCC_MC_APB2LPENSETR_ADFSDMLPEN_Msk        (0x1U << RCC_MC_APB2LPENSETR_ADFSDMLPEN_Pos)       /*!< 0x00200000 */
#define RCC_MC_APB2LPENSETR_ADFSDMLPEN            RCC_MC_APB2LPENSETR_ADFSDMLPEN_Msk                 /*!< Audio DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENSETR_FDCANLPEN_Pos         (24U)
#define RCC_MC_APB2LPENSETR_FDCANLPEN_Msk         (0x1U << RCC_MC_APB2LPENSETR_FDCANLPEN_Pos)        /*!< 0x01000000 */
#define RCC_MC_APB2LPENSETR_FDCANLPEN             RCC_MC_APB2LPENSETR_FDCANLPEN_Msk                  /*!< FDCAN and CANRAM peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_APB2LPENCLRR register  **************/
#define RCC_MC_APB2LPENCLRR_TIM1LPEN_Pos          (0U)
#define RCC_MC_APB2LPENCLRR_TIM1LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_TIM1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_APB2LPENCLRR_TIM1LPEN              RCC_MC_APB2LPENCLRR_TIM1LPEN_Msk                   /*!< TIM1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_TIM8LPEN_Pos          (1U)
#define RCC_MC_APB2LPENCLRR_TIM8LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_TIM8LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MC_APB2LPENCLRR_TIM8LPEN              RCC_MC_APB2LPENCLRR_TIM8LPEN_Msk                   /*!< TIM8 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_TIM15LPEN_Pos         (2U)
#define RCC_MC_APB2LPENCLRR_TIM15LPEN_Msk         (0x1U << RCC_MC_APB2LPENCLRR_TIM15LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MC_APB2LPENCLRR_TIM15LPEN             RCC_MC_APB2LPENCLRR_TIM15LPEN_Msk                  /*!< TIM15 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_TIM16LPEN_Pos         (3U)
#define RCC_MC_APB2LPENCLRR_TIM16LPEN_Msk         (0x1U << RCC_MC_APB2LPENCLRR_TIM16LPEN_Pos)        /*!< 0x00000008 */
#define RCC_MC_APB2LPENCLRR_TIM16LPEN             RCC_MC_APB2LPENCLRR_TIM16LPEN_Msk                  /*!< TIM16 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_TIM17LPEN_Pos         (4U)
#define RCC_MC_APB2LPENCLRR_TIM17LPEN_Msk         (0x1U << RCC_MC_APB2LPENCLRR_TIM17LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MC_APB2LPENCLRR_TIM17LPEN             RCC_MC_APB2LPENCLRR_TIM17LPEN_Msk                  /*!< TIM17 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_SPI1LPEN_Pos          (8U)
#define RCC_MC_APB2LPENCLRR_SPI1LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_SPI1LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_APB2LPENCLRR_SPI1LPEN              RCC_MC_APB2LPENCLRR_SPI1LPEN_Msk                   /*!< SPI/I2S1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_SPI4LPEN_Pos          (9U)
#define RCC_MC_APB2LPENCLRR_SPI4LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_SPI4LPEN_Pos)         /*!< 0x00000200 */
#define RCC_MC_APB2LPENCLRR_SPI4LPEN              RCC_MC_APB2LPENCLRR_SPI4LPEN_Msk                   /*!< SPI4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_SPI5LPEN_Pos          (10U)
#define RCC_MC_APB2LPENCLRR_SPI5LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_SPI5LPEN_Pos)         /*!< 0x00000400 */
#define RCC_MC_APB2LPENCLRR_SPI5LPEN              RCC_MC_APB2LPENCLRR_SPI5LPEN_Msk                   /*!< SPI5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_USART6LPEN_Pos        (13U)
#define RCC_MC_APB2LPENCLRR_USART6LPEN_Msk        (0x1U << RCC_MC_APB2LPENCLRR_USART6LPEN_Pos)       /*!< 0x00002000 */
#define RCC_MC_APB2LPENCLRR_USART6LPEN            RCC_MC_APB2LPENCLRR_USART6LPEN_Msk                 /*!< USART6 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_SAI1LPEN_Pos          (16U)
#define RCC_MC_APB2LPENCLRR_SAI1LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_SAI1LPEN_Pos)         /*!< 0x00010000 */
#define RCC_MC_APB2LPENCLRR_SAI1LPEN              RCC_MC_APB2LPENCLRR_SAI1LPEN_Msk                   /*!< SAI1 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_SAI2LPEN_Pos          (17U)
#define RCC_MC_APB2LPENCLRR_SAI2LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_SAI2LPEN_Pos)         /*!< 0x00020000 */
#define RCC_MC_APB2LPENCLRR_SAI2LPEN              RCC_MC_APB2LPENCLRR_SAI2LPEN_Msk                   /*!< SAI2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_SAI3LPEN_Pos          (18U)
#define RCC_MC_APB2LPENCLRR_SAI3LPEN_Msk          (0x1U << RCC_MC_APB2LPENCLRR_SAI3LPEN_Pos)         /*!< 0x00040000 */
#define RCC_MC_APB2LPENCLRR_SAI3LPEN              RCC_MC_APB2LPENCLRR_SAI3LPEN_Msk                   /*!< SAI3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_DFSDMLPEN_Pos         (20U)
#define RCC_MC_APB2LPENCLRR_DFSDMLPEN_Msk         (0x1U << RCC_MC_APB2LPENCLRR_DFSDMLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MC_APB2LPENCLRR_DFSDMLPEN             RCC_MC_APB2LPENCLRR_DFSDMLPEN_Msk                  /*!< DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_ADFSDMLPEN_Pos        (21U)
#define RCC_MC_APB2LPENCLRR_ADFSDMLPEN_Msk        (0x1U << RCC_MC_APB2LPENCLRR_ADFSDMLPEN_Pos)       /*!< 0x00200000 */
#define RCC_MC_APB2LPENCLRR_ADFSDMLPEN            RCC_MC_APB2LPENCLRR_ADFSDMLPEN_Msk                 /*!< Audio DFSDM peripheral clocks enable during CSleep mode */
#define RCC_MC_APB2LPENCLRR_FDCANLPEN_Pos         (24U)
#define RCC_MC_APB2LPENCLRR_FDCANLPEN_Msk         (0x1U << RCC_MC_APB2LPENCLRR_FDCANLPEN_Pos)        /*!< 0x01000000 */
#define RCC_MC_APB2LPENCLRR_FDCANLPEN             RCC_MC_APB2LPENCLRR_FDCANLPEN_Msk                  /*!< FDCAN and CANRAM peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_APB3LPENSETR register  **************/
#define RCC_MC_APB3LPENSETR_LPTIM2LPEN_Pos        (0U)
#define RCC_MC_APB3LPENSETR_LPTIM2LPEN_Msk        (0x1U << RCC_MC_APB3LPENSETR_LPTIM2LPEN_Pos)       /*!< 0x00000001 */
#define RCC_MC_APB3LPENSETR_LPTIM2LPEN            RCC_MC_APB3LPENSETR_LPTIM2LPEN_Msk                 /*!< LPTIM2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENSETR_LPTIM3LPEN_Pos        (1U)
#define RCC_MC_APB3LPENSETR_LPTIM3LPEN_Msk        (0x1U << RCC_MC_APB3LPENSETR_LPTIM3LPEN_Pos)       /*!< 0x00000002 */
#define RCC_MC_APB3LPENSETR_LPTIM3LPEN            RCC_MC_APB3LPENSETR_LPTIM3LPEN_Msk                 /*!< LPTIM3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENSETR_LPTIM4LPEN_Pos        (2U)
#define RCC_MC_APB3LPENSETR_LPTIM4LPEN_Msk        (0x1U << RCC_MC_APB3LPENSETR_LPTIM4LPEN_Pos)       /*!< 0x00000004 */
#define RCC_MC_APB3LPENSETR_LPTIM4LPEN            RCC_MC_APB3LPENSETR_LPTIM4LPEN_Msk                 /*!< LPTIM4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENSETR_LPTIM5LPEN_Pos        (3U)
#define RCC_MC_APB3LPENSETR_LPTIM5LPEN_Msk        (0x1U << RCC_MC_APB3LPENSETR_LPTIM5LPEN_Pos)       /*!< 0x00000008 */
#define RCC_MC_APB3LPENSETR_LPTIM5LPEN            RCC_MC_APB3LPENSETR_LPTIM5LPEN_Msk                 /*!< LPTIM5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENSETR_SAI4LPEN_Pos          (8U)
#define RCC_MC_APB3LPENSETR_SAI4LPEN_Msk          (0x1U << RCC_MC_APB3LPENSETR_SAI4LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_APB3LPENSETR_SAI4LPEN              RCC_MC_APB3LPENSETR_SAI4LPEN_Msk                   /*!< SAI4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENSETR_SYSCFGLPEN_Pos        (11U)
#define RCC_MC_APB3LPENSETR_SYSCFGLPEN_Msk        (0x1U << RCC_MC_APB3LPENSETR_SYSCFGLPEN_Pos)       /*!< 0x00000800 */
#define RCC_MC_APB3LPENSETR_SYSCFGLPEN            RCC_MC_APB3LPENSETR_SYSCFGLPEN_Msk                 /*!< SYSCFG peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENSETR_VREFLPEN_Pos          (13U)
#define RCC_MC_APB3LPENSETR_VREFLPEN_Msk          (0x1U << RCC_MC_APB3LPENSETR_VREFLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MC_APB3LPENSETR_VREFLPEN              RCC_MC_APB3LPENSETR_VREFLPEN_Msk                   /*!< VREF peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENSETR_DTSLPEN_Pos           (16U)
#define RCC_MC_APB3LPENSETR_DTSLPEN_Msk           (0x1U << RCC_MC_APB3LPENSETR_DTSLPEN_Pos)          /*!< 0x00010000 */
#define RCC_MC_APB3LPENSETR_DTSLPEN               RCC_MC_APB3LPENSETR_DTSLPEN_Msk                    /*!< DTS peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_APB3LPENCLRR register  **************/
#define RCC_MC_APB3LPENCLRR_LPTIM2LPEN_Pos        (0U)
#define RCC_MC_APB3LPENCLRR_LPTIM2LPEN_Msk        (0x1U << RCC_MC_APB3LPENCLRR_LPTIM2LPEN_Pos)       /*!< 0x00000001 */
#define RCC_MC_APB3LPENCLRR_LPTIM2LPEN            RCC_MC_APB3LPENCLRR_LPTIM2LPEN_Msk                 /*!< LPTIM2 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENCLRR_LPTIM3LPEN_Pos        (1U)
#define RCC_MC_APB3LPENCLRR_LPTIM3LPEN_Msk        (0x1U << RCC_MC_APB3LPENCLRR_LPTIM3LPEN_Pos)       /*!< 0x00000002 */
#define RCC_MC_APB3LPENCLRR_LPTIM3LPEN            RCC_MC_APB3LPENCLRR_LPTIM3LPEN_Msk                 /*!< LPTIM3 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENCLRR_LPTIM4LPEN_Pos        (2U)
#define RCC_MC_APB3LPENCLRR_LPTIM4LPEN_Msk        (0x1U << RCC_MC_APB3LPENCLRR_LPTIM4LPEN_Pos)       /*!< 0x00000004 */
#define RCC_MC_APB3LPENCLRR_LPTIM4LPEN            RCC_MC_APB3LPENCLRR_LPTIM4LPEN_Msk                 /*!< LPTIM4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENCLRR_LPTIM5LPEN_Pos        (3U)
#define RCC_MC_APB3LPENCLRR_LPTIM5LPEN_Msk        (0x1U << RCC_MC_APB3LPENCLRR_LPTIM5LPEN_Pos)       /*!< 0x00000008 */
#define RCC_MC_APB3LPENCLRR_LPTIM5LPEN            RCC_MC_APB3LPENCLRR_LPTIM5LPEN_Msk                 /*!< LPTIM5 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENCLRR_SAI4LPEN_Pos          (8U)
#define RCC_MC_APB3LPENCLRR_SAI4LPEN_Msk          (0x1U << RCC_MC_APB3LPENCLRR_SAI4LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_APB3LPENCLRR_SAI4LPEN              RCC_MC_APB3LPENCLRR_SAI4LPEN_Msk                   /*!< SAI4 peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENCLRR_SYSCFGLPEN_Pos        (11U)
#define RCC_MC_APB3LPENCLRR_SYSCFGLPEN_Msk        (0x1U << RCC_MC_APB3LPENCLRR_SYSCFGLPEN_Pos)       /*!< 0x00000800 */
#define RCC_MC_APB3LPENCLRR_SYSCFGLPEN            RCC_MC_APB3LPENCLRR_SYSCFGLPEN_Msk                 /*!< SYSCFG peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENCLRR_VREFLPEN_Pos          (13U)
#define RCC_MC_APB3LPENCLRR_VREFLPEN_Msk          (0x1U << RCC_MC_APB3LPENCLRR_VREFLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MC_APB3LPENCLRR_VREFLPEN              RCC_MC_APB3LPENCLRR_VREFLPEN_Msk                   /*!< VREF peripheral clocks enable during CSleep mode */
#define RCC_MC_APB3LPENCLRR_DTSLPEN_Pos           (16U)
#define RCC_MC_APB3LPENCLRR_DTSLPEN_Msk           (0x1U << RCC_MC_APB3LPENCLRR_DTSLPEN_Pos)          /*!< 0x00010000 */
#define RCC_MC_APB3LPENCLRR_DTSLPEN               RCC_MC_APB3LPENCLRR_DTSLPEN_Msk                    /*!< DTS peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_AHB2LPENSETR register  **************/
#define RCC_MC_AHB2LPENSETR_DMA1LPEN_Pos          (0U)
#define RCC_MC_AHB2LPENSETR_DMA1LPEN_Msk          (0x1U << RCC_MC_AHB2LPENSETR_DMA1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_AHB2LPENSETR_DMA1LPEN              RCC_MC_AHB2LPENSETR_DMA1LPEN_Msk                   /*!< DMA1 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENSETR_DMA2LPEN_Pos          (1U)
#define RCC_MC_AHB2LPENSETR_DMA2LPEN_Msk          (0x1U << RCC_MC_AHB2LPENSETR_DMA2LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MC_AHB2LPENSETR_DMA2LPEN              RCC_MC_AHB2LPENSETR_DMA2LPEN_Msk                   /*!< DMA2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENSETR_DMAMUXLPEN_Pos        (2U)
#define RCC_MC_AHB2LPENSETR_DMAMUXLPEN_Msk        (0x1U << RCC_MC_AHB2LPENSETR_DMAMUXLPEN_Pos)       /*!< 0x00000004 */
#define RCC_MC_AHB2LPENSETR_DMAMUXLPEN            RCC_MC_AHB2LPENSETR_DMAMUXLPEN_Msk                 /*!< DMAMUX peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENSETR_ADC12LPEN_Pos         (5U)
#define RCC_MC_AHB2LPENSETR_ADC12LPEN_Msk         (0x1U << RCC_MC_AHB2LPENSETR_ADC12LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MC_AHB2LPENSETR_ADC12LPEN             RCC_MC_AHB2LPENSETR_ADC12LPEN_Msk                  /*!< ADC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENSETR_USBOLPEN_Pos          (8U)
#define RCC_MC_AHB2LPENSETR_USBOLPEN_Msk          (0x1U << RCC_MC_AHB2LPENSETR_USBOLPEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_AHB2LPENSETR_USBOLPEN              RCC_MC_AHB2LPENSETR_USBOLPEN_Msk                   /*!< USBO peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENSETR_SDMMC3LPEN_Pos        (16U)
#define RCC_MC_AHB2LPENSETR_SDMMC3LPEN_Msk        (0x1U << RCC_MC_AHB2LPENSETR_SDMMC3LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MC_AHB2LPENSETR_SDMMC3LPEN            RCC_MC_AHB2LPENSETR_SDMMC3LPEN_Msk                 /*!< SDMMC3 and SDMMC3 delay (DLYBSD3) block peripheral clocks enable during CSleep mode */

